{"class_name": "Functional", "config": {"name": "functional_3", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_19"}, "name": "input_19", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_20"}, "name": "input_20", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_21"}, "name": "input_21", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_22"}, "name": "input_22", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_23"}, "name": "input_23", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_24"}, "name": "input_24", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_25"}, "name": "input_25", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_26"}, "name": "input_26", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_27"}, "name": "input_27", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_28"}, "name": "input_28", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_29"}, "name": "input_29", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_30"}, "name": "input_30", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_31"}, "name": "input_31", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_32"}, "name": "input_32", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_33"}, "name": "input_33", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_34"}, "name": "input_34", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_35"}, "name": "input_35", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_36"}, "name": "input_36", "inbound_nodes": []}, {"class_name": "Custom>TFBertMainLayer", "config": {"name": "bert", "trainable": true, "dtype": "float32", "config": {"return_dict": false, "output_hidden_states": false, "output_attentions": false, "use_cache": true, "torchscript": false, "use_bfloat16": false, "pruned_heads": {}, "tie_word_embeddings": true, "is_encoder_decoder": false, "is_decoder": false, "add_cross_attention": false, "tie_encoder_decoder": false, "max_length": 20, "min_length": 0, "do_sample": false, "early_stopping": false, "num_beams": 1, "temperature": 1.0, "top_k": 50, "top_p": 1.0, "repetition_penalty": 1.0, "length_penalty": 1.0, "no_repeat_ngram_size": 0, "bad_words_ids": null, "num_return_sequences": 1, "chunk_size_feed_forward": 0, "architectures": null, "finetuning_task": null, "id2label": {"0": "LABEL_0", "1": "LABEL_1"}, "label2id": {"LABEL_0": 0, "LABEL_1": 1}, "tokenizer_class": null, "prefix": null, "bos_token_id": null, "pad_token_id": 0, "eos_token_id": null, "sep_token_id": null, "decoder_start_token_id": null, "task_specific_params": null, "xla_device": null, "_name_or_path": "bert-base-uncased", "vocab_size": 30522, "hidden_size": 768, "num_hidden_layers": 12, "num_attention_heads": 12, "hidden_act": "gelu", "intermediate_size": 3072, "hidden_dropout_prob": 0.1, "attention_probs_dropout_prob": 0.1, "max_position_embeddings": 512, "type_vocab_size": 2, "initializer_range": 0.02, "layer_norm_eps": 1e-12, "gradient_checkpointing": false, "model_type": "bert"}}, "name": "bert", "inbound_nodes": [[["input_19", 0, 0, {"attention_mask": ["input_20", 0, 0], "token_type_ids": ["input_21", 0, 0]}]], [["input_22", 0, 0, {"attention_mask": ["input_23", 0, 0], "token_type_ids": ["input_24", 0, 0]}]], [["input_25", 0, 0, {"attention_mask": ["input_26", 0, 0], "token_type_ids": ["input_27", 0, 0]}]], [["input_28", 0, 0, {"attention_mask": ["input_29", 0, 0], "token_type_ids": ["input_30", 0, 0]}]], [["input_31", 0, 0, {"attention_mask": ["input_32", 0, 0], "token_type_ids": ["input_33", 0, 0]}]], [["input_34", 0, 0, {"attention_mask": ["input_35", 0, 0], "token_type_ids": ["input_36", 0, 0]}]]]}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_6", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "global_average_pooling1d_6", "inbound_nodes": [[["bert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_7", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "global_average_pooling1d_7", "inbound_nodes": [[["bert", 1, 0, {}]]]}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_8", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "global_average_pooling1d_8", "inbound_nodes": [[["bert", 2, 0, {}]]]}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_9", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "global_average_pooling1d_9", "inbound_nodes": [[["bert", 3, 0, {}]]]}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_10", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "global_average_pooling1d_10", "inbound_nodes": [[["bert", 4, 0, {}]]]}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_11", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "global_average_pooling1d_11", "inbound_nodes": [[["bert", 5, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_15", "inbound_nodes": [[["global_average_pooling1d_6", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_17", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_17", "inbound_nodes": [[["global_average_pooling1d_7", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_19", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_19", "inbound_nodes": [[["global_average_pooling1d_8", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_21", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_21", "inbound_nodes": [[["global_average_pooling1d_9", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_23", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_23", "inbound_nodes": [[["global_average_pooling1d_10", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_25", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_25", "inbound_nodes": [[["global_average_pooling1d_11", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_44", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_44", "inbound_nodes": [[["dense_15", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_45", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_45", "inbound_nodes": [[["dense_17", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_46", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_46", "inbound_nodes": [[["dense_19", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_47", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_47", "inbound_nodes": [[["dense_21", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_48", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_48", "inbound_nodes": [[["dense_23", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_49", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_49", "inbound_nodes": [[["dense_25", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_16", "trainable": true, "dtype": "float32", "units": 8, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_16", "inbound_nodes": [[["dropout_44", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_18", "trainable": true, "dtype": "float32", "units": 8, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_18", "inbound_nodes": [[["dropout_45", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_20", "trainable": true, "dtype": "float32", "units": 8, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_20", "inbound_nodes": [[["dropout_46", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_22", "trainable": true, "dtype": "float32", "units": 8, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_22", "inbound_nodes": [[["dropout_47", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_24", "trainable": true, "dtype": "float32", "units": 8, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_24", "inbound_nodes": [[["dropout_48", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_26", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_26", "inbound_nodes": [[["dropout_49", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_1", "inbound_nodes": [[["dense_16", 0, 0, {}], ["dense_18", 0, 0, {}], ["dense_20", 0, 0, {}], ["dense_22", 0, 0, {}], ["dense_24", 0, 0, {}], ["dense_26", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_27", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_27", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_50", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_50", "inbound_nodes": [[["dense_27", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_28", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_28", "inbound_nodes": [[["dropout_50", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_29", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_29", "inbound_nodes": [[["dense_28", 0, 0, {}]]]}], "input_layers": [["input_19", 0, 0], ["input_20", 0, 0], ["input_21", 0, 0], ["input_22", 0, 0], ["input_23", 0, 0], ["input_24", 0, 0], ["input_25", 0, 0], ["input_26", 0, 0], ["input_27", 0, 0], ["input_28", 0, 0], ["input_29", 0, 0], ["input_30", 0, 0], ["input_31", 0, 0], ["input_32", 0, 0], ["input_33", 0, 0], ["input_34", 0, 0], ["input_35", 0, 0], ["input_36", 0, 0]], "output_layers": [["dense_29", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}